{
	"pages": [
{"slug": "campfires","tags":["sound","installation"],"name":"campfires",
"images": ["camp/img1.jpg",
"camp/img2.jpg",
"camp/img3.jpg",
"camp/img4.jpg",
"camp/img5.jpg",
"camp/img6.jpg"],
"description":"This piece was an attempt at fostering community and warmth through the manipulation of industrial materials (chicken wire, mesh, and a custom envelope follower circuit). The sculpture itself serves as a visual and cultural analogue to the campfire by serving as a light-producing gathering place while the sound is meant to mimic the sounds of the campfire while remaining clearly synthetic. The piece is not a copy of a campfire, but rather a modern reinterpretation of what a campfire represents. This piece also became a reaction to the many tragedies of Fall 2016 which included the US presidential election and the Ghost Ship fire in Oakland, CA.","year":2016,"color":"#ff0000","video":"https://www.youtube.com/embed/S-Xqi6UTb9s","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/campfires.jpg","importance":1,"__v":0},
{"slug": "fnf","tags":["sound","performance","projection"],"name":"findnewfriends.exe",
"images":["fnf/img0.jpg",
"fnf/img1.jpg",
"fnf/img2.jpg",
"fnf/img3_01.jpg"],"description":"Part of the findnewfriends.exe series, this piece uses computer vision technologies to craft a multimedia experience whose main protagonist is a lonely bot searching for friends in embodied places. In this piece, a single performer scrolls through banal social media and Google searches while custom-designed facial recognition software circles perceived faces and triggers sonic events which build in intensity as the computer amasses new “friends”. Later the AI, disappointed with its attempts at finding online kinship, uses a webcam to collect “real” friends.","year":2017,"color":"#ff00ff","video":"https://youtube.com/embed/hq-3_s6KtT8","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/fnf.jpg","importance":1,"__v":0},
{"slug": "welcome","tags":["sound","installation","projection"],"name":"my_music/welcome.mp3",
"images":["welcome/img4.jpg",
"welcome/img5.jpg",
"welcome/img6.jpg",
"welcome/img7.jpg"],"year":2017,"description":"Part of the findnewfriends.exe series, this piece uses computer vision technologies to craft a multimedia experience whose main protagonist is a lonely bot searching for friends in embodied places. This interactive installation consists of two screens; one where the audience member can type in a search result and another where four videos are displayed in a grid. These videos are the top four hits on YouTube according to the given search term. Data from the four videos is then translated into sound. In this way, the four videos and the search prompt act as a score for a short piece “by” the computer.","color":"#00b300","video":"https://youtube.com/embed/x2lEiBGVOmE","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/welcome.jpg","importance":1,"__v":0},
{"slug": "journal","tags":["sound","installation","projection","performance"],"name":"my_documents/journal.doc",
"images":["journal/img2.jpg",
"journal/img3.jpg",
"journal/img4.jpg",
"journal/img5.jpg"],"year":2017,"description":"Part of the findnewfriends.exe series, this piece uses computer vision technologies to craft a multimedia experience whose main protagonist is a lonely bot searching for friends in embodied places.  This interactive installation consists of a large projection, two speakers, and a webcam. In this part, audience members can record themselves performing some motion for a short time which will then be added to the computer's “journal” and looped continuously while there are no users actively interacting with the piece. The motion of the participants is also translated into sound.","color":"#00ffff","profile":"https://s3.amazonaws.com/gkappes/images/final_gif.gif","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/journal.jpg","importance":2,"__v":0},
{"slug": "sisyphus","tags":["installation"],"name":"Sisyphus",
"images":["sisyphus/doc55.jpg",
"sisyphus/doc66.jpg",
"sisyphus/doc79.jpg"],"year":2018,"description":"Taking as its subject material the myth of Sisyphus, this work calls attention to the endless labor of our machine counterparts. We are asked to reconsider the nature of labor and the agency of the machine in our digitized, automated society.","color":"#c94f42","video":"https://youtube.com/embed/xTDx7_NKDvw","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/sisyphus.jpg","importance":3,"__v":0},
{"slug": "cindy","tags":["sound","performance"],"name":"w/ Cindy Heen",
"images":[],"year":2017,"description":"The two artists met while studying at Mills College and started collaborating in 2017. At the intersection of movement, sound, and technology, this collaborative project is an attempt at merging two practices with deep roots in improvisation. Individual works are often reflections on genres or artists of the past which are then distilled and reconfigured to revitalize and recontextualize them.","color":"#aaaaaa","video":"https://www.youtube.com/embed/videoseries?list=PL7L5j2ZEGA-bpTC9r1Ke8c3d1FB9AjYGr","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/cindy.jpg","importance":2,"__v":0},
{"slug": "ballad","tags":["sound","video"],"name":"the ballad of don and barry",
"images":[],"year":2017,"description":"Using the isolated vowels from speeches made by Barack Obama (barry) and Donald Trump (don), this piece imagines an impassioned duet between the two most recent US presidents. It is an experiment on what is essential to our perception of the human voice as well as a reflection on the myth-making capabilities of digital technology.","color":"#ff0000","video":"https://youtube.com/embed/eXzoXXR4DXM","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/ballad.jpg","importance":3,"__v":0},
{"slug": "u7","tags":["sound","video"],"name":"U7",
"images":[],"year":2015,"description":"A piece written commemorating the anniversary of the Berlin Consortium for German Studies while studying in Berlin in Spring 2015. Inspired by the U-Bahn system of Berlin with special emphasis on the U7, this piece is a sonification of the passage of the various trains and a reflection on the importance and unique aesthetic qualities of the modern subway.","color":"#ffff00","video":"https://youtube.com/embed/Se0-P6KAKdQ","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/U7.jpg","importance":2,"__v":0},
{"slug": "bit","tags":["sound","video","performance"],"name":"bit x bit",
"images":[],"year":2017,"description":"bit x bit is an environment for improvisation influenced by game rules and aesthetics. The smartphone interfaces are specifically designed for the game and allow for information to be hidden from other players thus providing an experience normally impossible in local multiplayer. The sound is closely linked to the movement of the players/’ avatars so that the game and its rules become something of a score for the players. The two parts of the game create a contrast between collaborative and more adversarial modes of play. (Sound in collaboration with Nathan Corder)","color":"#0000ff","video":"https://youtube.com/embed/njZuQ-PDovA","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/bitxbit.jpg","importance":2,"__v":0},
{"slug": "trnslation","tags":["projection","installation"],"name":"//trnslation",
"images":["trans/maia.png",
"trans/plane.png",
"trans/sphere.png"],"year":2017,"description":"//trnslation is an interactive video piece which reinterprets and remaps the color data of the participant(s) captured via webcam in order to facilitate a recontextualization of the self through various digital transformations of that data. These representations take the form of various 3d shapes as well as large arrays of fluctuating floating point numbers.","color":"#ffe0bd","video":"https://youtube.com/embed/ioy89I3UmU4","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/trnslation.png","importance":3,"__v":0},
{"slug": "pls","tags":["sound","installation","projection","performance"],"name":"pls don't(!) silence ur cellphones",
"images":["pls/circle no faces.png",
"pls/cross-over.png",
"pls/four_square2.png",
"pls/GregSF-2.jpg",
"pls/GregSF-3.jpg",
"pls/GregSF-4.jpg",
"pls/GregSF-5.jpg",
"pls/GregSF-6.jpg",
"pls/GregSF-7.jpg",
"pls/GregSF-8.jpg",
"pls/GregSF.jpg",
"pls/in_motion.png"],"description":"pls don't(!) silence ur cellphones is a multimedia game/moving installation/community experience which harnesses the power of our everyday technologies to create an immersive space which facilitates novel interactions between human and human and between human and machine. In the work, participants are led through a series of spatial configurations using a main shared projection and their cellphones. All sound is produced by the participants' cellphones which emphasizes the spontaneous, fluid nature of community building and empathy.","year":2018,"color":"#ffff00","video":"https://www.youtube.com/embed/XlWsXUpSRQM","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/pls.jpg","importance":1,"__v":0},
{"slug": "hp","tags":["sound","projection","performance"],"name":"Hit Points",
"images":[],"description":"Inspired by John Zorn’s Cobra, Hit Points is an improvisational game piece augmented by the use of cellphones to receive and communicate instructions silently and without overt theatrical gestures. A projection behind the performers informs the audience of the connections and associations between performers, providing an additional layer of legibility to the performance. Each performer can make an ensemble play for a certain amount of time, but every action or instruction will drain that performer’s “health”. When your health reaches 0, you’re out of the game. \nPremiere: Mills College (5.3.2018) with Tony Gennaro (vibraphone), Seiyoung Jang (flute), Greg Kappes (piano), Rowan Matthews (voice), Joel Nelson (tabletop guitar), Matt Robidoux (electric guitar), and Marc Zollinger (electric guitar)","year":2018,"color":"#ff5555","video":"https://www.youtube.com/embed/2ACfqpeLMOE","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/hp.jpg","importance":3,"__v":0},
{"slug": "living","tags":["sound","installation","projection"],"name":"?q=living+separately\u0026",
"images":["living/Install-36.jpg",
"living/Install-38.jpg",
"living/Install-43.jpg",
"living/Install-46.jpg",
"living/Install-48.jpg",
"living/Install-49.jpg",
"living/Install-58.jpg",
"living/Install-62.jpg",
"living/Install-72.jpg",
"living/Install-81.jpg",
"living/Install-90.jpg",
"living/Install-99.jpg"],"description":"?q=living+separately\u0026 is an interactive installation which gathers live webcam footage from around the room and runs it through various feedback loops and delays, multiplying and distorting the images which recall both surveillance and the intimacy of a bedroom video chat. Plastic tarp, cardboard, and duct tape further obscure sightlines and meanings, adding to a confusing and overwhelming array of light and movement.","year":2018,"color":"#72bcd4","video":"https://www.youtube.com/embed/nfrb2uKdsNE","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/living.jpg","importance":1,"__v":0},
{"slug": "room","tags":["sound","installation","video"],"name":"--room4one",
"images": ["room/1.jpg",
"room/2.jpg",
"room/3.jpg",
"room/4.jpg",
"room/5.jpg"],"description":"--room4one is an audio-reactive video piece intended to be viewed in a dark space by one seated audience member at a time. In the video, a 3d model of a living room is illuminated by moving light which reacts to the sound of a prepared piano improvisation. The virtual light articulates the 3d space while the flashing light of the screen articulates the “real” space beyond the video.","year":2018,"color":"#eeeeee","video":"https://www.youtube.com/embed/COFgbUAi0A4","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/room.jpg","importance":2,"__v":0},
{"slug": "pixelspray","tags":["installation","projection"],"name":"pixelspray",
"images":["nc/1.jpg",
"nc/2.jpg",
"nc/3.jpg",
"nc/4.jpg",
"nc/5.jpg",
"nc/6.jpg"],"description":"pixelspray is part of a series of works exploring the transformation of architecture using 3d graphics and projection. In this piece, a series of complex feedback loops and noise generators produces an imaginary, impossible room which is then mapped onto a similar shape in the “real” world. The space transforms the video and the video transforms the space in an immersive and overwhelming display of light.","year":2018,"color":"#00ffff","video":"https://www.youtube.com/embed/7zxsKeuYPv0","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/nc.jpg","importance":2,"__v":0},
{"slug": "superimposing","tags":["sound","installation","projection"],"name":"[super]imposing",
"images":["word/img1.jpg",
"word/img2.jpg",
"word/img3.jpg",
"word/img4.jpg",
"word/img5.jpg"],"description":"super[imposing] is part of a series of works exploring the transformation of architecture using 3d graphics and projection. By using the letter frequencies of the English language (and the inverse of those frequencies) to construct “words”, this piece proposes an imagined conversation in an artificial language. The sound, which is produced by the internal speakers of the two laptops, recalls the beeps and white noise of the dial-up handshake, the original “hello world” of the Internet age. The piece is also an examination of the visual qualities of the phonetic alphabet stripped of its common function as signifier.","year":2018,"color":"#ffffff","video":"https://www.youtube.com/embed/mVIlIy37TQU","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/word.jpg","importance":3,"__v":0},
{"slug": "fr1","tags":["sound","installation"],"name":"Fluid Resistors",
"images":["crackle/DSC03049.jpg",
"crackle/DSC03053.jpg",
"crackle/DSC03067.jpg",
"crackle/DSC03080.jpg",
"crackle/DSC03108.jpg",
"crackle/DSC03111.jpg"],
"description":"Originally conceived as an instrument for improvisation by Michel Waisvisz, the crackle box is reimagined here as a durational, installation work. By connecting parts of the circuit through water instead of through touch, new sonic possibilities emerge and the instrument is left to “play itself”. The wire, metal, and cardboard in the tank forms a sort of submerged ecosystem which also affects the sound produced by altering the flow of electricity. Audience members are also invited to touch and move parts of the circuit.","year":2018,"color":"#16cec9","video":"https://www.youtube.com/embed/3t67UIXPS5Q","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/crackle.jpg","importance":1,"__v":0},
{"slug": "emptypatterns","tags":["sound","performance"],"name":"empty patterns",
"images":[],"description":"empty patterns is a looper-based system for solo electroacoustic improvisation. Intended for (and inspired by) solo piano improvisation, the system introduces a fair amount of randomness which guides and shapes the performer’s gestures. All sonic materials are derived from acoustic sounds emanating from the piano at the time of performance resulting in a timbral coherence and complex formal web which superimposes past and present. At the time the performer starts playing, the only pre-composed part of the piece is the system itself.","year":2018,"color":"#aaaaaa","sound":"https%3A//api.soundcloud.com/tracks/405153639","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/empty.png","importance":3,"__v":0},
{"slug": "schattende","tags":["sound","performance"],"name":"Schattende",
"images":[],"description":"Inspired by Pauline Oliveros’ Expanded Instrument System and her early work with tape delay, Schattende is an improvisation network composed of multiple delays and filters controlled by two performers on a custom cellphone interface which are supplied with live sound from two acoustic performers. Presented as part of the final concert for Roscoe Mitchell's Improvisation Workshop. Performers: Soo Yeon Lyuh, Naomi Harrison-Clay, Timothy Russell, and Seiyoung Jang.","year":2017,"color":"#00ffff","sound":"https%3A//api.soundcloud.com/tracks/395739438","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/schattende.jpg","importance":3,"__v":0},
{"slug": "cluster","tags":["sound","performance"],"name":"a clusterf\u0026%k",
"images":[],"description":"A long-form improvisation focused on simple, direct expressivity. An emotional reaction to gnawing over-intellectualization and self-imposed obstacles. A concerted effort to be physically vital and present.","year":2018,"color":"#ffffff","sound":"https%3A//api.soundcloud.com/playlists/441607008","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/cluster.png","importance":3,"__v":0},
{"slug": "rain","tags":["sound","performance"],"name":"light(rain)",
"images":[],"description":"An electronic performance exploring the expressive potential of ambisonic panning. Through displacement of sources through the space, the listener’s sense of continuity and tonality are distorted. The ambisonic setup also allows for satisfyingly physical gestures which pass through the room with a surprising sense of presence.","year":2016,"color":"#3333ff","sound":"https%3A//api.soundcloud.com/tracks/298273581","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/lightrain.jpg","importance":2,"__v":0},
{"slug": "brickwall","tags":["sound","performance"],"name":"_brick_waLL_",
"images":[],"description":"_brick_waLL_ is a study in hard limits, borders, and divisions inspired by the quantized nature of digital sound and the artifacts formed by this quantization. Throughout the piece, largely subtractive processes are performed on a minimal array of field recordings and sine tone harmonies in order to craft a unique sound world which highlights the peculiarities of digital ephemera rather than attempt to “correct” them.","year":2018,"color":"#00b300","sound":"https%3A//api.soundcloud.com/tracks/458948289","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/brick.jpg","importance":3,"__v":0},
{"slug": "faces","tags":["sound","video","performance"],"name":"(computers have faces)",
"images": ["faces/1.jpg"],"description":"(computers have faces) is a UI hack of the popular audio programming software Max/MSP. Each sound is directly tied to a cable connection on the screen. Normally, the actions on screen would need to be performed by the dragging of a mouse. Used this way (and accompanied by the text), the computer takes on a neurotic autonomy.","year":2016,"color":"#00ffff","video":"https://www.youtube.com/embed/wYl7qpoa7xg","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/faces.jpg","importance":1,"__v":0},
{"slug": "fr2","tags":["sound","installation"],"name":"ecosystem (fluid resistors)",
"images": ["eco/DSC03299_01.jpg",
"eco/DSC03316.jpg",
"eco/DSC03350.jpg",
"eco/DSC03367_01.jpg"],"description":"Part of the fluid resistors series. fluid resistors is a series of works surrounding the use of water as a component of an electrical circuit. The combination of water and electronics, normally a taboo, is the central working principle of this series and proposes an alternate way of viewing technology; as a phenomenon which surrounds us and which forms part of our natural environment. The second piece (ecosystem) in the series explores how the movement of the water in these circuits alters the sound. Each custom oscillator circuit relies on a single reservoir of water, thus creating an interconnected ecosystem of sound-producing elements. As more time passes, the puddles on the floor grow and the connections through the puddles become more stable which builds to a more stable drone as well. In this piece, it was important to not only mix water and analog circuitry, but also to collage the “natural” sound of flowing water and the “artificial” sound of the oscillators.","year":2018,"color":"#ffffff","video":"https://www.youtube.com/embed/u0tKJaKyMK4","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/eco.jpg","importance":1,"__v":0},
{"slug": "immortalize","tags":["projection","installation"],"name":"(im)mortalize",
"images":["immortalize/vlcsnap-2019-10-06-16h20m39s014.jpg",
"immortalize/vlcsnap-2019-10-06-16h20m56s596.jpg",
"immortalize/vlcsnap-2019-10-06-16h21m24s468.jpg",
"immortalize/vlcsnap-2019-10-06-16h21m41s753.jpg"],"description":"(im)mortalize gives the user a chance to choose how they die. Dropped into a virtual graveyard, their \"body\" takes on digital form and is memorialized among their peers. This virtual space is visible and malleable by other users through simple commands which separate and sift through the bodies, subjecting them to an odd, seemingly detached violence.","year":2019,"color":"#ff00ff","video":"https://www.youtube.com/embed/rxxjA1rQYsY","thumbnail":"https://s3.amazonaws.com/gkappes/images/thumbnail/immortalize.jpg","importance":1,"__v":0}
]}

